In [161]:
# import dependencies 
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2
import sqlite3
from tabulate import tabulate
import config

## Extract

#### Sqlite

In [4]:
#connect to sqlite db 
sqlite_conn = sqlite3.connect("../sqlite/database.sqlite")
sqlite_cur = sqlite_conn.cursor()

In [6]:
#query all table names 
tables_df = pd.DataFrame(sqlite_cur.execute("SELECT name FROM sqlite_master WHERE type='table'"))
tables_df.columns = [i[0] for i in sqlite_cur.description]
tables_df

      name
0  reviews
1  artists
2   genres
3   labels
4    years
5  content

In [125]:
#create dictionary with table names that will hold table data
df_dict = {'reviews':None,'artists':None,'genres':None,'labels':None,
           'years':None,'content':None}

In [127]:
for i in list(df_dict.keys()): #iterate through dictionary 
    df_dict[i] = pd.DataFrame(sqlite_cur.execute(f'SELECT * FROM {i}')) #query each table and create dataframe object
    df_dict[i].columns = [i[0] for i in sqlite_cur.description] #get header/columns

#### Review Data

In [172]:
#review data 
df_dict['reviews'].head(2)
df_dict['artists'].head(2)
df_dict['labels'].head(2)
df_dict['years'].head(2)
df_dict['content'].head(2)

,reviewid,title,artist,url,score,best_new_music,author,author_type,pub_date,pub_weekday,pub_day,pub_month,pub_year
0,22703,mezzanine,massive attack,http://pitchfork.com/reviews/albums/22703-mezz...,9.3,0,nate patrin,contributor,2017-01-08,6,8,1,2017
1,22721,prelapsarian,krallice,http://pitchfork.com/reviews/albums/22721-prel...,7.9,0,zoe camp,contributor,2017-01-07,5,7,1,2017

   reviewid          artist
0     22703  massive attack
1     22721        krallice

   reviewid      label
0     22703     virgin
1     22721  hathenter

   reviewid    year
0     22703  1998.0
1     22721  2016.0

   reviewid                                            content
0     22703  “Trip-hop” eventually became a ’90s punchline,...
1     22721  Eight years, five albums, and two EPs in, the ...

-----

## load

In [ ]:
#connect to postgres database 
conn = psycopg2.connect(database="postgres", user=config.db_user, password=config.db_password, sslmode="disable")
cur = conn.cursor();

In [ ]:
#cerate postgres database to hold pitchfork data 
conn = psycopg2.connect(database="postgres", user=config.db_user, password=config.db_password, sslmode="disable")
cur = conn.cursor()
conn.autocommit = True
cur.execute('''CREATE DATABASE pitchfork_2''')
conn.close()

In [170]:
#create sqlaclechemy database connection with newly created database 
database = f"postgresql+psycopg2://{config.db_user}:{config.db_password}@localhost:5432/pitchfork?gssencmode=disable"
engine = create_engine(database)

In [169]:
for i in list(df_dict.keys()): #iterate through dictionary taht holds dataframes of data
    df_dict[i].to_sql(name=i, index=False, con=engine, if_exists='replace', chunksize=100000) # load data into database 
    print(f"Table {i} loaded")

Table reviews loaded
Table artists loaded
Table genres loaded
Table labels loaded
Table years loaded
Table content loaded